КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Настройки/КонтурЛогистика_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Настройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоДляРасширения</name>
    <comment>В расширениях до 8.3.20 запрещено использовать предопределенные. Будем использовать это поле.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗначений</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ВсеСправочникиУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПодписания/КонтурЛогистика_НастройкиПодписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиПодписания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УдалитьОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>Используется только если не настроена должность в сертификате</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьМЧД</name>
    <comment>Единый регистрационный номер доверенности, Уникальный идентификатор доверенности в виде 36-разрядного GUID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИдСистХран</name>
    <comment>ИдСистХран - Идентифицирующие сведения об информационной системе, в которой хранится доверенность, используемая для подтверждения полномочий в электронной форме (СвСистХран для некоторых сообщений)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСтатусПодписанта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОрганизация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИздатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыпускаМЧД</name>
    <comment>в драфте 5.02 более нет необходимости указывать дату доверки в титуле</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ДатаДовер</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ВнНомДовер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьТипМодуляКриптографии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИмяМодуляКриптографии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВводитьПарольВПрограммеЭлектроннойПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_СертификатыЭлектроннойПодписи</types>
    </type>
  </resources>
  <resources>
    <name>МЧД</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_МЧД</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертификатБезМЧД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопСведенияОПодписанте</name>
    <comment>Дополнительные сведения о подписанте</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийСпособПодтвержденияПолномочий</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>ИсключениеДляОтдельныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСтатусаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>taskIdRegisterPOA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВалидации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНастройки</name>
    <comment>Для метрик</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь1С</name>
    <comment>не заполнен - общее значение для организации</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СертификатНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопПараметр</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыПМ/КонтурЛогистика_ТипыПМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыПМ</name>
  <enumValues>
    <name>Отключен</name>
  </enumValues>
  <enumValues>
    <name>ВСоставеКонфигурации</name>
  </enumValues>
  <enumValues>
    <name>ФайлНаДиске</name>
  </enumValues>
  <enumValues>
    <name>ВСправочнике</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/ДополнительныеОтчетыИОбработки/ДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДополнительныеОтчетыИОбработки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БезопасныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляФормыОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляФормыСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Публикация</name>
    <type>
      <types>EnumRef.ВариантыПубликацииДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетХранилищеВариантов</name>
    <comment>Когда Истина то дополнительный отчет подключен к хранилищу вариантов &quot;ХранилищеВариантовОтчетов&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТеснаяИнтеграцияСФормойОтчета</name>
    <comment>Когда Истина то у отчета есть программный интерфейс для тесной интеграции с общей формой &quot;ФормаОтчета&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСовместимостиРазрешений</name>
    <type>
      <types>EnumRef.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Команды</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантЗапуска</name>
      <type>
        <types>EnumRef.СпособыВызоваДополнительныхОбработок</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьОповещение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Модификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегламентноеЗаданиеGUID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Скрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаменяемыеКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Назначение</name>
    <attributes>
      <name>ОбъектНазначения</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разрешения</name>
    <attributes>
      <name>ВидРазрешения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметры</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Настройки/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПредопределенных = Новый Структура;

	// поддержим работу в расширении	
	МассивИменПредопределенных = Новый Массив;
	МассивИменПредопределенных.Добавить("СвоиНастройки");
	МассивИменПредопределенных.Добавить("ПодключаемыйМодульПуть");
	МассивИменПредопределенных.Добавить("ПодключаемыйМодульТип");
	МассивИменПредопределенных.Добавить("СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");
	МассивИменПредопределенных.Добавить("СохранятьАрхивДокументооборотаВКаталог");
	МассивИменПредопределенных.Добавить("КаталогСохраненияАрхиваДокументооборота");
	МассивИменПредопределенных.Добавить("ИспользуютсяМногиеКОдному");
	МассивИменПредопределенных.Добавить("КонтактыАдминистратора_АдресаЭлектронныхПочт");
	МассивИменПредопределенных.Добавить("КонтактыАдминистратора_Телефоны");
	МассивИменПредопределенных.Добавить("ДопустимоеПревышениеМассыГрузаНадГрузоподъемностьюТС");
	МассивИменПредопределенных.Добавить("МинимальныйПериодАктуальностиДанныхОрганизации");
	МассивИменПредопределенных.Добавить("КлючРазработчикаДиадокTestkontur");
	МассивИменПредопределенных.Добавить("КлючРазработчика");
	МассивИменПредопределенных.Добавить("EDI_РасположениеМодуля");
	МассивИменПредопределенных.Добавить("EDI_ПутьКМодулю");
	Для Каждого ПредопределенноеИмя Из МассивИменПредопределенных Цикл
		СтруктураПредопределенных.Вставить(ПредопределенноеИмя, 
				Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(ПредопределенноеИмя));
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		Объект.Родитель = СтруктураПредопределенных.СвоиНастройки;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Объект.ТипЗначения) ИЛИ
			(Объект.Наименование = "Путь до файла обработки epf" И
			ПолучитьТипПМ() = Перечисления.КонтурЛогистика_ТипыПМ.ФайлНаДиске) Тогда
			
			Справочники.КонтурЛогистика_Настройки.УстановитьНастройкеЗначениеПоУмолчанию(Объект.Ссылка);
			Прочитать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоПользовательскаяНастройка = Справочники.КонтурЛогистика_Настройки.ЭтоПользовательскаяНастройка(Объект);
	
	УстановитьТипЗначенияЭлементаЗначения();
	УстановитьОписаниеТипаШаблонаДляОтправкиКонтрагенту();
	
	Если Найти(Объект.ИмяПредопределенногоДляРасширения, "Пароль") <> 0
		Или Найти(Объект.ИмяПредопределенногоДляРасширения, "КлючРазработчика") <> 0 Тогда
		Элементы.Значение.РежимПароля = Истина;
	КонецЕсли;
	
	Элементы.ГруппаСписокНастройки.Видимость 				= ЭтоПользовательскаяНастройка;
	Элементы.ИмяПредопределенныхДанных.ТолькоПросмотр 		= Не ЭтоПользовательскаяНастройка;
	
	УправлениеОтображениемДляОтдельныхНастроек();
	
	ТекПользовательПродвинутый = (КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		Или РольДоступна("КонтурЛогистика_НастройкаПодсистемы"));
	
	Если Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_Телефоны
		И Не Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм") Тогда
		
		Сообщить("Для отправки сообщений необходимо включить настройку: Использовать отправку в Телеграм");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеОтображениемДляОтдельныхНастроек()
	
	Если Объект.Ссылка = СтруктураПредопределенных.КаталогСохраненияАрхиваДокументооборота Тогда
		
		КонтурЛогистика_РаботаСЭлементамиФормыСервер.СоздатьЭлементыФормыДляКаталогаСохраненияАрхиваДокументооборота(ЭтаФорма);
				
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.СохранятьАрхивДокументооборотаВКаталог Тогда
		
		// Не важно под какой организацией получаем данные
		ТочноеСовпадение = Ложь;
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
		Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
			
			ТекстПредупреждения = "Ни у одной из наших организаций не заполнена авторизация в Логистике";
			КонтурЛогистика_РаботаСЭлементамиФормыСервер.ВывестиПредупреждениеНастройкиАрхива(ЭтаФорма, ТекстПредупреждения);
			
		КонецЕсли;
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы Тогда
		
		Если (КонтурЛогистика_МетрикаПовтИсп.ВерсияБСП() = "0.0.0" Или КонтурЛогистика_МетрикаПовтИсп.ВерсияБСП() = Неопределено) 
			И Метаданные.Справочники.Найти("ХранилищеДополнительнойИнформации") = Неопределено Тогда
			
			ТекстПредупреждения = "В конфигурации отсутствует БСП или справочник ХранилищеДополнительнойИнформации. Используйте подключаемый модуль";
			КонтурЛогистика_РаботаСЭлементамиФормыСервер.ВывестиПредупреждениеНастройкиАрхива(ЭтаФорма, ТекстПредупреждения);
			
		КонецЕсли;
		
		ТочноеСовпадение = Ложь;
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
		Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
			
			ТекстПредупреждения = "Ни у одной из наших организаций не заполнена авторизация в Логистике";
			КонтурЛогистика_РаботаСЭлементамиФормыСервер.ВывестиПредупреждениеНастройкиАрхива(ЭтаФорма, ТекстПредупреждения);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЭлементУправленияЗначениемБулево()
	
	Если Объект.ТипЗначения = "Булево" Тогда
		
		ЗначениеБулево = Объект.Значение;
		Элементы.Значение.Видимость = Ложь;
		Элементы.ГруппаТумблер.Видимость = Истина;
		
		Элементы.Вкл.Видимость = Объект.Значение = Истина;
		Элементы.Выкл.Видимость = Объект.Значение <> Истина;
		
		Если Объект.Значение = Истина Тогда 
			Элементы.Состояние.Заголовок = "Включено";
		Иначе
			Элементы.Состояние.Заголовок = "Отключено";
		КонецЕсли;
		
	Иначе
		
		Элементы.Значение.Видимость = Истина;
		Элементы.ГруппаТумблер.Видимость = Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Прочитать(); // объект мог быть изменен ПриСозданииНаСервере
	УстановитьЭлементУправленияЗначениемБулево();
	ОбновитьВидимостьГруппыТелеграм();
	
	Если Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_АдресаЭлектронныхПочт Тогда
		
		ИспользоватьОтправкуНаПочту = НастройкиОтправкиПочтыЗаполнены();
		Если Не ИспользоватьОтправкуНаПочту Тогда
			Закрыть();
			Сообщить("Необходимо заполнить данные учетной записи электронной почты для отправки сообщений администратору");
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"ОбщаяФорма.КонтурЛогистика_НастройкаУчетнойЗаписиЭлектроннойПочты",, ЭтаФорма, ЭтаФорма,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_Телефоны
		И ЗначениеЗаполнено(Объект.Значение) Тогда
		
		ПроверитьРегистрациюТелефонаТелеграм();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиОтправкиПочтыЗаполнены()
	
	Возврат КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
КонецФункции

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	УстановитьТипЗначенияЭлементаЗначения();

КонецПроцедуры

&НаСервере
Функция ПолучитьТипПМ()
	
	ПодключаемыйМодульТип = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ПодключаемыйМодульТип");
	
	Возврат ПодключаемыйМодульТип;
	
КонецФункции
&НаСервере
Функция ПолучитьТипУстановкиEDI()
	
	ПодключаемыйМодульТип = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("EDI_РасположениеМодуля");
	
	Возврат ПодключаемыйМодульТип;
	
КонецФункции

&НаСервере
Процедура УстановитьТипЗначенияЭлементаЗначения()
	                    
	Если ЭтоПользовательскаяНастройка 
		ИЛИ (Объект.Наименование = "Путь до файла обработки epf" 
		И ПолучитьТипПМ() = Перечисления.КонтурЛогистика_ТипыПМ.ВСправочнике) Тогда 
		
		Если ЗначениеЗаполнено(Объект.ТипЗначения) Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип(Объект.ТипЗначения));
			ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
		Иначе
			ОписаниеТиповЗначения = Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная));
		КонецЕсли;
		
		Элемент = Элементы.Значение;
		Элемент.ОграничениеТипа = ОписаниеТиповЗначения;
		Элемент.ДоступныеТипы 	= ОписаниеТиповЗначения;
		Элемент.ВыбиратьТип 	= Ложь;		
		
		Объект.Значение 		= Элемент.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
		
		Элементы.ТипЗначения.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Описание.РедактированиеТекста = Истина;
		Элементы.Наименование.РедактированиеТекста = Истина;
				
	Иначе	
		
		ОписаниеТиповЗначения = Новый ОписаниеТипов(Объект.ТипЗначения);
		
		Элемент = Элементы.Значение;
		Элемент.ОграничениеТипа = ОписаниеТиповЗначения; 
		Элемент.ДоступныеТипы 	= ОписаниеТиповЗначения;
		Элемент.ВыбиратьТип 	= Ложь;
		
		Объект.Значение 		= Элемент.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
		
		Элементы.ТипЗначения.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Описание.РедактированиеТекста = Ложь;
		Элементы.Наименование.РедактированиеТекста = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтоПользовательскаяНастройка Тогда
		
		СписокВыбора = МассивТиповЗначенийЭлементов("Справочники", "Перечисления", "ПримитивныеТипы");		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьИзСписка_КонтурЛогистика(СписокВыбора, , ЭтаФорма, "ТипЗначенияНачалоВыбораЗавершение");	
		
	ИначеЕсли Объект.Наименование = "Путь до файла обработки epf" И
		ПолучитьТипПМ() = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыПМ.ВСправочнике") Тогда
		
		СписокВыбора = МассивТиповЗначенийЭлементов("Справочники");		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьИзСписка_КонтурЛогистика(СписокВыбора, , ЭтаФорма, "ТипЗначенияНачалоВыбораЗавершение");	
		
	Иначе
		
		УстановитьТипЗначенияЭлементаЗначения();	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияНачалоВыбораЗавершение(ВыбранныйЭлемент, ТекДанные) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТипЗначения = ВыбранныйЭлемент.Значение;
	УстановитьТипЗначенияЭлементаЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВклНажатие(Элемент)
	
	Если Объект.ИмяПредопределенногоДляРасширения = "РазрешитьПодписьНаСервере"
		И КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() <> "Файловая"
		И ЕстьНастройкиССервернымСертификатом() Тогда
		
		// Проверим для клиент-серверной базы, что не осталось используемых сертификатов на сервере
		Сообщить("Не возможно отключить настройку, так как есть настройки подписания с серверным сертификатом.");
		Возврат;
	КонецЕсли;
	
	Если ТекПользовательПродвинутый Тогда
		
		// Может быть в некоторых случаях = Неопределено
		Если Объект.Значение = Неопределено Тогда
			Объект.Значение = Ложь;
		КонецЕсли;
		
		Объект.Значение = Не Объект.Значение;
		УстановитьЭлементУправленияЗначениемБулево();
		ВыполнитьДополнительныеДействия();
		
	Иначе
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(
			"Менять настройки может пользователь с полными правами или ролью ""Настройка подсистемы""", "Нет доступа");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьНастройкиССервернымСертификатом()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПодписания", ТекущаяДатаСеанса());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере), ЛОЖЬ) КАК СертификатНаСервере
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_НастройкиПодписания.СрезПоследних(&ДатаПодписания, ) КАК КонтурЛогистика_НастройкиПодписанияСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.СертификатНаСервере;
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыклНажатие(Элемент)
	
	Если ТекПользовательПродвинутый Тогда
		
		// Может быть в некоторых случаях = Неопределено
		Если Объект.Значение = Неопределено Тогда
			Объект.Значение = Ложь;
		КонецЕсли;
		
		Объект.Значение = Не Объект.Значение;
		УстановитьЭлементУправленияЗначениемБулево();
		ВыполнитьДополнительныеДействия();
		
	Иначе
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(
			"Менять настройки может пользователь с полными правами или ролью ""Настройка подсистемы""", "Нет доступа");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Ссылка = СтруктураПредопределенных.ПодключаемыйМодульПуть Тогда 
		
		ПодключаемыйМодульТип = ПолучитьТипПМ();
		
		Если ЗначениеЗаполнено(ПодключаемыйМодульТип) И
			ПодключаемыйМодульТип = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыПМ.ВСправочнике") Тогда		
			
			СписокОбработокСправочника = СписокОбработокСправочника();
			
			Если СписокОбработокСправочника.Количество() > 0 Тогда 
				СписокОбработокСправочника.ПоказатьВыборЭлемента(
					СформироватьОповещениеВыбора(),
					"Выберите обработку подключаемого модуля",
					Элементы.Значение); 
			Иначе
				КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Справочник внешних обработок пуст");
			КонецЕсли;
			
		Иначе	
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
				"ОбработатьВыборФайлаПМ", 
				ЭтаФорма, 
				РежимДиалогаВыбораФайла.Открытие, 
				"Укажите подключаемый модуль (ПУТЬ с СЕРВЕРА 1С)", 
				, 
				"Внешняя обработка 1С8 (*.epf)|*.epf");
			
		КонецЕсли;
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.EDI_ПутьКМодулю Тогда 
		
		ТипУстановкиEDI = ПолучитьТипУстановкиEDI();
		
		Если ЗначениеЗаполнено(ТипУстановкиEDI) И
			ТипУстановкиEDI = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыПМ.ВСправочнике") Тогда		
			
			СписокОбработокСправочника = СписокОбработокСправочника();
			
			Если СписокОбработокСправочника.Количество() > 0 Тогда 
				СписокОбработокСправочника.ПоказатьВыборЭлемента(
					СформироватьОповещениеВыбора(),
					"Выберите обработку Контур.EDI",
					Элементы.Значение); 
			Иначе
				КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Справочник внешних обработок пуст");
			КонецЕсли;
			
		Иначе	
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
				"ОбработатьВыборФайлаПМ", 
				ЭтаФорма, 
				РежимДиалогаВыбораФайла.Открытие, 
				"Укажите модуль EDI (ПУТЬ с СЕРВЕРА 1С)", 
				, 
				"Внешняя обработка 1С8 (*.epf)|*.epf");
		КонецЕсли;
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.КаталогСохраненияАрхиваДокументооборота Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
			"ОбработатьВыборКаталогаАрхиваДокументооборота", 
			ЭтаФорма, 
			РежимДиалогаВыбораФайла.ВыборКаталога, 
			"Выберите каталог сохранения архива документооборота"); 
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_Телефоны Тогда
		
		Если ЗначениеЗаполнено(Объект.Значение) Тогда
			ПроверитьРегистрациюТелефонаТелеграм();
		Иначе
			ОбновитьВидимостьГруппыТелеграм();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьОповещениеВыбора()
	
	ПараметрыОповещения = Новый Массив;
	ПараметрыОповещения.Добавить("ПутьНачалоВыбораЗавершение");
	ПараметрыОповещения.Добавить(ЭтаФорма);
	
	ОписаниеОповещения = Новый("ОписаниеОповещения", ПараметрыОповещения);
	Возврат ОписаниеОповещения;
	
КонецФункции

&НаКлиенте
Процедура ПутьНачалоВыбораЗавершение(Результат, ДопПараметры = Неопределено) Экспорт

	Если Результат <> Неопределено Тогда
		Объект.Значение = Результат.Значение;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	
	Если Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_Телефоны Тогда
		
		Если ЗначениеЗаполнено(Объект.Значение) Тогда
			ПроверитьРегистрациюТелефонаТелеграм();
		Иначе
			ОбновитьВидимостьГруппыТелеграм();
		КонецЕсли;
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.ДопустимоеПревышениеМассыГрузаНадГрузоподъемностьюТС Тогда
		
		Если Объект.Значение > 100 Тогда
			Объект.Значение = 100;
		ИначеЕсли Объект.Значение < 0 Тогда
			Объект.Значение = 0;
		КонецЕсли;
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.МинимальныйПериодАктуальностиДанныхОрганизации Тогда
		
		Если Объект.Значение < 0 Тогда
			Объект.Значение = 0;
		КонецЕсли;
		
	ИначеЕсли (Объект.Ссылка = СтруктураПредопределенных.КлючРазработчикаДиадокTestkontur
		Или Объект.Ссылка = СтруктураПредопределенных.КлючРазработчика)
		И ЗначениеЗаполнено(Объект.Значение) Тогда
		
		ДвоичныеДанные = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьДвоичныеДанныеИзСтроки_КонтурЛогистика(Объект.Значение);
  		Объект.Значение = Base64Строка(ДвоичныеДанные);
		
	ИначеЕсли Объект.ИмяПредопределенногоДляРасширения = "ПЭ_ТипШаблонаДляОтправкиКонтрагенту"
		Или Объект.ИмяПредопределенногоДляРасширения = "ЗЗ_ТипШаблонаДляОтправкиКонтрагенту" Тогда
		
		УстановитьОписаниеТипаШаблонаДляОтправкиКонтрагенту();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОписаниеТипаШаблонаДляОтправкиКонтрагенту()
	
	Справочники.КонтурЛогистика_Настройки.УстановитьОписаниеТипаШаблонаДляОтправкиКонтрагенту(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайлаПМ(МассивВыбранныхФайлов, НеиспользуемыйПараметр = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(МассивВыбранныхФайлов) Тогда 
		Объект.Значение = МассивВыбранныхФайлов[0];
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.Ссылка = СтруктураПредопределенных.ПодключаемыйМодульПуть
		ИЛИ Объект.Ссылка = СтруктураПредопределенных.ПодключаемыйМодульТип
		Тогда
		
		Оповестить("ИзменениеПараметровПМ");
		
		ОбновитьПовторноИспользуемыеЗначения();
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.ИспользуютсяМногиеКОдному И Объект.Значение Тогда
		
		Оповестить("КонтурЛогистика_ПоискОснованийКодНа1СПоУмолчанию");
				
	КонецЕсли;
	
	Оповестить("ИзменениеОбщейНастройки", Объект.ИмяПредопределенногоДляРасширения);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если Объект.ИмяПредопределенногоДляРасширения = "АвтоматическоеПолучениеИОтправкаQRКодов" Тогда
		
		Попытка
			ВключитьВыключитьРегламентноеЗаданиеАвтоматическоеПолучениеИОтправкаQRКодов(Объект.Значение);
		Исключение
			
			Ошибка			= ИнформацияОбОшибке();
			ПодробнаяОшибка	= ПодробноеПредставлениеОшибки(Ошибка);
			
			Сообщить(ПодробнаяОшибка);
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВключитьВыключитьРегламентноеЗаданиеАвтоматическоеПолучениеИОтправкаQRКодов(НовоеПоложениеИспользования = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегЗаданиеАвтоматическоеПолучениеИОтправкаQRКодов = Метаданные.РегламентныеЗадания.Найти("КонтурЛогистика_АвтоматическоеПолучениеИОтправкаQRКодов");
	
	Если РегЗаданиеАвтоматическоеПолучениеИОтправкаQRКодов = Неопределено Тогда
		
		Если Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") = Неопределено Тогда
			Возврат Ложь;	
		КонецЕсли;
		
		ДопОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", КонтурЛогистика_РежимРасширенияСервер.ИмяОбработкиРегламентныхЗаданийДляРасширенияКонтурЛогистика());
		
		Если ЗначениеЗаполнено(ДопОбработка) Тогда
			
			ДопОбработкаОб = ДопОбработка.ПолучитьОбъект();
			
			Для каждого Команда Из ДопОбработкаОб.Команды Цикл
				
				Если Команда.Идентификатор = "КонтурЛогистика_АвтоматическоеПолучениеИОтправкаQRКодов"
					И Команда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода Тогда
					
					ЗаписатьОбработку = Ложь;
					
					Если НовоеПоложениеИспользования И Не ЗначениеЗаполнено(Команда.РегламентноеЗаданиеGUID) Тогда 
						
						ПараметрыЗадания = Новый Структура;
						ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
						ПараметрыЗадания.Вставить("Использование", Истина);
						НовоеРегламентное = КонтурЛогистика_РежимРасширенияСервер.ДобавитьРегламентноеЗадание(ПараметрыЗадания);	
						
						Команда.РегламентноеЗаданиеGUID = НовоеРегламентное.УникальныйИдентификатор;
						
						ЗаписатьОбработку = Истина;
						
					ИначеЕсли Не НовоеПоложениеИспользования И ЗначениеЗаполнено(Команда.РегламентноеЗаданиеGUID) Тогда
						
						Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Команда.РегламентноеЗаданиеGUID);
						Если Задание <> Неопределено Тогда
							Задание.Удалить();
						КонецЕсли;
						
						Команда.РегламентноеЗаданиеGUID = Неопределено;
						
						ЗаписатьОбработку = Истина;
						
					КонецЕсли;
					
					Если ЗаписатьОбработку Тогда
						ДопОбработкаОб.Записать();
					КонецЕсли;
														
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		текРЗ = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.КонтурЛогистика_АвтоматическоеПолучениеИОтправкаQRКодов);
	
		Если текРЗ = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Регламентное задание с таким идентификатором уже недоступно";
			Сообщение.Сообщить();
			Возврат Ложь;
			
		Иначе
			
			Если Не КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор() Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Управление заданиями доступно только для администратора";
				Сообщение.Сообщить();
				Возврат текРЗ.Использование;
				
			Иначе
				
				Если НовоеПоложениеИспользования = Неопределено Тогда 
					НовоеПоложениеИспользования = не текРЗ.Использование;
				КонецЕсли;
				
				текРЗ.Использование = НовоеПоложениеИспользования;
				текРЗ.Записать();
				Возврат текРЗ.Использование;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьДополнительныеДействия()

	Если Не Найти(Объект.ИмяПредопределенногоДляРасширения, "Автоконвертация_") = 0 
		И Объект.Значение = Истина Тогда // Автоконвертация_КонтурЛогистика_ПунктыМаршрута
		
		ТипСправочникаЛогистика = СтрЗаменить(Объект.ИмяПредопределенногоДляРасширения, "Автоконвертация_", "");
		
		Если Не НастрокаКонвертацииСправочникаСуществует(ТипСправочникаЛогистика) Тогда
		
			ПараметрыФормы = Новый Структура("ТипСправочникаЛогистика", ТипСправочникаЛогистика);
						
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаЭлемента", 
				ПараметрыФормы, 
				ЭтаФорма,,,, 
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
			
			КонецЕсли;
			
	ИначеЕсли Объект.ИмяПредопределенногоДляРасширения = "ИспользоватьТестовыйСерверДиадок" Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.УбратьПризнакНашПриСменеОкружения();
		
	ИначеЕсли Объект.ИмяПредопределенногоДляРасширения = "ИспользоватьОтправкуВТелеграм"
		И Объект.Значение = Истина Тогда
	
		КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика("Запустить проверку регистрации водителей в Телеграм?", РежимДиалогаВопрос.ДаНет, "Подтвердите обработку",, ЭтаФорма, "АктуализироватьСтатусыВодителейТелеграм");
	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьСтатусыВодителейТелеграм(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = КонтурЛогистика_ОбработкаДокументовСервер.АктуализироватьСтатусыВодителейТелеграм();
	
	Если Результат = Истина Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Статусы Телеграм водителей успешно актуализированы!");
		
	Иначе
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Не удалось актуализировать статусы Телеграм водителей по причине:" + Символы.ПС + СокрЛП(Результат));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастрокаКонвертацииСправочникаСуществует(ТипСправочникаЛогистика)
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииСправочника(
		ТипСправочникаЛогистика);
	
	Возврат КонтекстНастройкиКонвертации.ЕстьКонвертация;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если (ЗавершениеРаботы = Ложь Или ЗавершениеРаботы = Неопределено)
		И Не Объект.Ссылка.Пустая() Тогда 
		
		Оповестить("ОбновитьСтартовыйПомошник", Объект.Ссылка);
		Оповестить("ОбновитьРабочийСтол", Объект.Ссылка);
		Оповестить("КонтурЛогистика_ОбновитьФизическиеЛица");
		
		Если Объект.Ссылка = СтруктураПредопределенных.СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы Тогда
			
			ДатаГраницыПолученияПечатныхФормЭПД = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ДатаГраницыПолученияПечатныхФормЭПД");
			
			Если Объект.Значение И Не ЗначениеЗаполнено(ДатаГраницыПолученияПечатныхФормЭПД) Тогда		
				Оповестить("КонтурЛогистика_УстановитьДатуГраницыПолученияПечатныхФормЭПД");			
			КонецЕсли;
			
		ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.СохранятьАрхивДокументооборотаВКаталог Тогда
			
			ДатаГраницыСохраненияАрхиваДокументооборота = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ДатаГраницыСохраненияАрхиваДокументооборота");
			КаталогСохраненияАрхиваДокументооборота = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("КаталогСохраненияАрхиваДокументооборота");
			
			Если Объект.Значение И Не ЗначениеЗаполнено(ДатаГраницыСохраненияАрхиваДокументооборота) Тогда		
				Оповестить("КонтурЛогистика_УстановитьДатуГраницыСохраненияАрхиваДокументооборота");
			ИначеЕсли Объект.Значение И Не ЗначениеЗаполнено(КаталогСохраненияАрхиваДокументооборота) Тогда
				Оповестить("КонтурЛогистика_УстановитьКаталогСохраненияАрхиваДокументооборота");
			КонецЕсли;
															
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокОбработокСправочника()
	
	СписокОбработок = Новый СписокЗначений;
	
	ИмяСправочникаДопОбработки = "ДополнительныеОтчетыИОбработки";
	ЭтоСтарыеМетаданныеВнешнихОбработок = Ложь;
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	Если ИмяКонфигурации = "УТ"
		Или ИмяКонфигурации = "УПП" Тогда
		
		ЭтоСтарыеМетаданныеВнешнихОбработок = Истина;
		ИмяСправочникаДопОбработки = "ВнешниеОбработки";
		
	ИначеЕсли ИмяКонфигурации = "КЛ" Тогда
		
		ИмяСправочникаДопОбработки = "УчетнаяСистема_ВнешниеОбработки";
		ЭтоСтарыеМетаданныеВнешнихОбработок = Истина;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка,
	               |	ДополнительныеОтчетыИОбработки.Наименование КАК Наименование" 
				   + ?(Не ЭтоСтарыеМетаданныеВнешнихОбработок, ",
	               |	ДополнительныеОтчетыИОбработки.Версия КАК Версия,
	               |	ДополнительныеОтчетыИОбработки.Публикация КАК Публикация"
				   , "") + "
	               |ИЗ
	               |	Справочник." + ИмяСправочникаДопОбработки + " КАК ДополнительныеОтчетыИОбработки
	               |ГДЕ
	               |	НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления"
				   + ?(Не ЭтоСтарыеМетаданныеВнешнихОбработок, "
	               |	И ДополнительныеОтчетыИОбработки.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка)"
				   , "");

	
	Попытка
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			ТаблицаОбработок = Результат.Выгрузить();
			
			Для Каждого ТекОбработка Из ТаблицаОбработок Цикл
				
				Если ЭтоСтарыеМетаданныеВнешнихОбработок Тогда
					СписокОбработок.Добавить(ТекОбработка.Ссылка, ТекОбработка.Наименование, , БиблиотекаКартинок.СправочникОбъект);
				Иначе
					СписокОбработок.Добавить(ТекОбработка.Ссылка, ТекОбработка.Наименование + " v." + ТекОбработка.Версия + " ("+ТекОбработка.Публикация + ")", , БиблиотекаКартинок.СправочникОбъект);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		
		// нет доступа или не смогли понять какой справочник
		Сообщить("Нет доступа к справочнику внешних обработок или не смогли понять какой справочник внешних обработок использовать
		|" + ОписаниеОшибки());
		
	КонецПопытки;			   
	
	Возврат СписокОбработок;
	
КонецФункции

&НаСервере
Функция МассивТиповЗначенийЭлементов(Справочники = Неопределено, 
	
	Перечисления = Неопределено, ПримитивныеТипы = Неопределено)
	
	СписокВыбора = КонтурЛогистика_ОбщегоНазначенияСервер.МассивТиповЗначенийЭлементов(Справочники,	Перечисления, ПримитивныеТипы, "КонтурЛогистика_Настройки");	
	СписокВыбора.СортироватьПоЗначению();
	
	Возврат СписокВыбора;
	
КонецФункции

#КонецОбласти

#Область НастройкиАрхива

&НаКлиенте
Процедура ОбработатьВыборКаталогаАрхиваДокументооборота(Результат, НеиспользуемыйПараметр = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда 
		
		Объект.Значение = Результат[0];
		
		ПроверитьДоступКаталогаСохраненияАрхиваДокументооборота();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступКаталогаСохраненияАрхиваДокументооборота()
	
	Если Не ЗначениеЗаполнено(Объект.Значение) Тогда
		Сообщить("Выберите каталог");
		Возврат;
	КонецЕсли;
	
	ПроверитьДоступКаталогаСохраненияАрхиваДокументооборотаНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДоступКаталогаСохраненияАрхиваДокументооборотаНаСервере()
	
	Попытка
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ИмяФайла = Строка(Новый УникальныйИдентификатор) + ".txt";
		ИмяПромежуточногоФайла = СокрЛП(Объект.Значение) + "\" + ИмяФайла;
		ТекстовыйДокумент.Записать(ИмяПромежуточногоФайла);
		
		УдалитьФайлы(ИмяПромежуточногоФайла);
		
		Элементы.РезультатПроверкиДоступаКаталога.ЦветТекста = Новый Цвет(51, 153, 102); // зеленый
		Элементы.РезультатПроверкиДоступаКаталога.Заголовок = "Каталог доступен";
		
	Исключение
		
		Элементы.РезультатПроверкиДоступаКаталога.ЦветТекста = Новый Цвет(255, 0, 0); // красный
		Элементы.РезультатПроверкиДоступаКаталога.Заголовок = "Нет доступа";
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаНомераТелеграм

&НаКлиенте
Процедура ПроверитьРегистрациюТелефонаТелеграм()
	
	ИдетПроверкаТелефонаВТелеграм = Истина;
	ПодключитьОбработчикОжидания("ПроверитьРегистрациюТелефонаТелеграмВФоне", 0.1, Истина);
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРегистрациюТелефонаТелеграмВФоне()
	
	ТелефонЗарегестрированВТелеграм = ПроверитьРегистрациюТелеграмНаСервере(Объект.Значение);
	ИдетПроверкаТелефонаВТелеграм = Ложь;
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьРегистрациюТелеграмНаСервере(Телефон)
	
	Попытка
		ТелефонЗарегестрированВТелеграм = КонтурЛогистика_РаботаСТелеграм.ТелефонЗарегестрирован(Телефон);
	Исключение
		ТелефонЗарегестрированВТелеграм = Ложь;
	КонецПопытки;
	
	Возврат ТелефонЗарегестрированВТелеграм;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьГруппыТелеграм()
	
	Если Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_Телефоны Тогда
		Элементы.ГруппаПроверкаТелеграм.Видимость = Истина;
	Иначе
		Элементы.ГруппаПроверкаТелеграм.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Ложь;
	Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Ложь;
	Элементы.ДекорацияПодключитьТелеграм.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Значение) Тогда
		Элементы.ГруппаПроверкаТелеграм.Видимость = Истина;
		
		Если ИдетПроверкаТелефонаВТелеграм Тогда
			Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Истина;
		ИначеЕсли ТелефонЗарегестрированВТелеграм Тогда
			Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПодключитьТелеграм.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаПроверкаТелеграм.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодключитьТелеграмНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_QRКодБотаКаналаТелеграм",,
		ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
